Revit 2026 API

# FamilyManagerSetValueString Method

---

Set the string value of a family parameter of the current family type.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetValueString(
	FamilyParameter familyParameter,
	string value
)
```
```vb
Public Sub SetValueString (
	familyParameter As FamilyParameter,
	value As String
)
```
```cpp
public:
void SetValueString(
	FamilyParameter^ familyParameter,
	String^ value
)
```
```fsharp
member SetValueString :
        familyParameter : FamilyParameter *
        value : string -> unit
```

#### Parameters

familyParameter FamilyParameter
    The family parameter of current type.
value String
    The new value string for family parameter.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the input argument-"familyParameter" or "value"-is . |
| ArgumentException | Thrown when the input argument-"familyParameter"-is an invalid family parameter. or the input argument-"value"-is an illegal string. |
| ArgumentOutOfRangeException | Thrown when the input argument-"familyParameter"-is out of range. |
| InvalidOperationException | Thrown when the family parameter is determined by formula, or it is not a value type, or the current family type is invalid. |

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace